# При введенні числових даних часто зустрічається типова проблема: користувач вводить текст замість чисел.
# При спробі перетворити дані в int генерується виняток ValueError. Напишіть функцію, яка приймає два числа,
# шукає їх суму і виводить результат. Перехопіть виняток ValueError, якщо будь-яке із вхідних значень не є числом,
# і виведіть зручне повідомлення про помилку. Протестуйте функцію: спочатку введіть два числа,
# а потім введіть текст замість одного з чисел.

# код має бути організований у функцію
# передається у функцію те що ввів користувач
# перетворення і обробки помилок відбуваються в середині функції
def revision(a, b):
    try:
        a = int(a)
        b = int(b)
        print(a + b)
    except ValueError:
        print('Використовуйте лише числа')
        
a = input()
b = input()
revision(a, b)